In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('iris.csv')
df.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [4]:
df['is_setosa'] = np.where(df['Species'] == 'setosa', 1, 0)

In [8]:
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species  is_setosa
0           5.1          3.5           1.4          0.2  setosa          1
1           4.9          3.0           1.4          0.2  setosa          1
2           4.7          3.2           1.3          0.2  setosa          1
3           4.6          3.1           1.5          0.2  setosa          1
4           5.0          3.6           1.4          0.2  setosa          1

In [9]:
df.tail()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa
145,6.7,3.0,5.2,2.3,virginica,0
146,6.3,2.5,5.0,1.9,virginica,0
147,6.5,3.0,5.2,2.0,virginica,0
148,6.2,3.4,5.4,2.3,virginica,0
149,5.9,3.0,5.1,1.8,virginica,0

In [11]:
df['is_setosa'].value_counts()

is_setosa
0    100
1     50
Name: count, dtype: int64

In [12]:
df['is_setosa'].value_counts(normalize = True)

is_setosa
0    0.666667
1    0.333333
Name: proportion, dtype: float64

In [13]:
pd.crosstab(df['Species'], df['is_setosa'])

is_setosa    0   1
Species
setosa       0  50
versicolor  50   0
virginica   50   0

In [14]:
df['is_setosa_2'] = (df['Species'] == 'setosa') + 0
df['is_setosa_3'] = (df['Species'] == 'setosa') * 1

In [15]:
pd.crosstab(df['Species'], df['is_setosa_2'])

is_setosa_2   0   1
Species
setosa        0  50
versicolor   50   0
virginica    50   0

In [16]:
df.head()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1

In [18]:
df = df.rename({'Sepal.Length': "SL"})

In [19]:
df.head()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1

In [20]:
bike = pd.read_csv('bike.csv')
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [23]:
bike.columns

Index(['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count'],
      dtype='object')

In [26]:
bike_sub = bike.loc[:4, 'casual':'registered']
# same to bike_sub = bike.loc[:4, ['casual', 'registered']]

In [27]:
bike_sub

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1

In [28]:
bike_sub.sum()

casual        19
registered    83
dtype: int64

In [29]:
bike_sub.sum(axis=1) # 이럴 일은 잘 없을듯

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [30]:
bike_sub.apply(func = sum)

casual        19
registered    83
dtype: int64

In [31]:
bike_sub.apply(func = sum, axis = 1) # 예시일 뿐..

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [34]:
bike_sub.apply(func = lambda x: round(x.mean()))

casual         4
registered    17
dtype: int64

In [35]:
bike_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   casual      5 non-null      int64
 1   registered  5 non-null      int64
dtypes: int64(2)
memory usage: 212.0 bytes

In [36]:
bike_sub['casual']

0    3
1    8
2    5
3    3
4    0
Name: casual, dtype: int64

In [37]:
bike_sub['casual'].astype('str') + " ea"

0    3 ea
1    8 ea
2    5 ea
3    3 ea
4    0 ea
Name: casual, dtype: object

In [38]:
bike.head(3)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32

In [39]:
bike['datetime'][:3]

0    2011-01-01 00:00:00
1    2011-01-01 01:00:00
2    2011-01-01 02:00:00
Name: datetime, dtype: object

In [44]:
bike['datetime'][:3].str.slice(0, 4)

0    2011
1    2011
2    2011
Name: datetime, dtype: object

In [45]:
bike['datetime'][:3].str.slice(5, 7)

0    01
1    01
2    01
Name: datetime, dtype: object

In [46]:
bike_time = pd.to_datetime(bike['datetime'][:3])

In [47]:
bike_time

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
2   2011-01-01 02:00:00
Name: datetime, dtype: datetime64[ns]

In [48]:
bike_time.dt.year

0    2011
1    2011
2    2011
Name: datetime, dtype: int32

In [49]:
bike_time.dt.month

0    1
1    1
2    1
Name: datetime, dtype: int32

In [50]:
bike_time.dt.day

0    1
1    1
2    1
Name: datetime, dtype: int32

In [51]:
bike_time.dt.weekday

0    5
1    5
2    5
Name: datetime, dtype: int32

In [52]:
bike.head(3)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32

In [54]:
bike_sub = bike[['datetime', 'temp', 'season']]
bike_sub.head(3)

              datetime  temp  season
0  2011-01-01 00:00:00  9.84       1
1  2011-01-01 01:00:00  9.02       1
2  2011-01-01 02:00:00  9.02       1

In [55]:
bike_sub.head(15)

               datetime   temp  season
0   2011-01-01 00:00:00   9.84       1
1   2011-01-01 01:00:00   9.02       1
2   2011-01-01 02:00:00   9.02       1
3   2011-01-01 03:00:00   9.84       1
4   2011-01-01 04:00:00   9.84       1
5   2011-01-01 05:00:00   9.84       1
6   2011-01-01 06:00:00   9.02       1
7   2011-01-01 07:00:00   8.20       1
8   2011-01-01 08:00:00   9.84       1
9   2011-01-01 09:00:00  13.12       1
10  2011-01-01 10:00:00  15.58       1
11  2011-01-01 11:00:00  14.76       1
12  2011-01-01 12:00:00  17.22       1
13  2011-01-01 13:00:00  18.86       1
14  2011-01-01 14:00:00  18.86       1

In [58]:
bike_dum = pd.get_dummies(bike_sub, dtype=int, columns = ['season'])

In [59]:
bike_dum.head(3)

              datetime  temp  season_1  season_2  season_3  season_4
0  2011-01-01 00:00:00  9.84         1         0         0         0
1  2011-01-01 01:00:00  9.02         1         0         0         0
2  2011-01-01 02:00:00  9.02         1         0         0         0

In [60]:
bike_dum = pd.get_dummies(bike_sub, dtype=int, columns = ['season'], drop_first = True)

In [61]:
bike_dum.head(3)

              datetime  temp  season_2  season_3  season_4
0  2011-01-01 00:00:00  9.84         0         0         0
1  2011-01-01 01:00:00  9.02         0         0         0
2  2011-01-01 02:00:00  9.02         0         0         0

# Q1

In [62]:
bike_q1 = pd.read_csv('bike.csv')

In [63]:
bike_q1.head(3)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32

In [69]:
gap_q1 = abs(bike_q1['temp'] - bike_q1['atemp'])
gap_q1.head(3)

0    4.555
1    4.615
2    4.615
dtype: float64

In [70]:
round(gap_q1.mean(), ndigits=3)

np.float64(3.509)

In [76]:
# cleaner answer
round((bike_q1['temp'] - bike_q1['atemp']).abs().mean(),ndigits=3)

np.float64(3.509)

# Q2

In [85]:
bike['datetime'] = pd.to_datetime(bike['datetime'])

In [86]:
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [88]:
bike['date'] = bike['datetime'].dt.date

In [89]:
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,date
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,2011-01-01
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,2011-01-01
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,2011-01-01
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13,2011-01-01
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1,2011-01-01

In [92]:
bike.groupby('date')['casual'].max()

date
2011-01-01    47
2011-01-02    20
2011-01-03    14
2011-01-04    18
2011-01-05    12
              ..
2012-12-15    95
2012-12-16    67
2012-12-17    22
2012-12-18    58
2012-12-19    37
Name: casual, Length: 456, dtype: int64

In [94]:
bike_q3_res = bike.groupby('date')['casual'].max()

In [95]:
bike_q3_res

date
2011-01-01    47
2011-01-02    20
2011-01-03    14
2011-01-04    18
2011-01-05    12
              ..
2012-12-15    95
2012-12-16    67
2012-12-17    22
2012-12-18    58
2012-12-19    37
Name: casual, Length: 456, dtype: int64

In [96]:
type(bike_q3_res)

pandas.core.series.Series

In [97]:
bike_q3_res[0]

C:\Users\eunsang.jeon\AppData\Local\Temp\ipykernel_29128\2120092214.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  bike_q3_res[0]

np.int64(47)

In [98]:
bike_q3_res.iloc[0]

np.int64(47)

In [101]:
bike_q3_res.info()

<class 'pandas.core.series.Series'>
Index: 456 entries, 2011-01-01 to 2012-12-19
Series name: casual
Non-Null Count  Dtype
--------------  -----
456 non-null    int64
dtypes: int64(1)
memory usage: 23.3+ KB

In [103]:
bike_q3_res.index

Index([2011-01-01, 2011-01-02, 2011-01-03, 2011-01-04, 2011-01-05, 2011-01-06,
       2011-01-07, 2011-01-08, 2011-01-09, 2011-01-10,
       ...
       2012-12-10, 2012-12-11, 2012-12-12, 2012-12-13, 2012-12-14, 2012-12-15,
       2012-12-16, 2012-12-17, 2012-12-18, 2012-12-19],
      dtype='object', name='date', length=456)

In [111]:
bike_q3_res.loc[pd.to_datetime('2011-01-01').date()]

np.int64(47)

In [112]:
bike_q3_res = bike_q3_res[bike_q3_res > 25]

In [113]:
bike_q3_res.head()

date
2011-01-01    47
2011-01-15    33
2011-01-16    35
2011-02-06    52
2011-02-12    47
Name: casual, dtype: int64

In [114]:
bike_q3_res.count()

np.int64(384)

# Q3

In [116]:
bike = pd.read_csv('bike.csv')

In [117]:
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [118]:
bike['datetime'] = pd.to_datetime(bike['datetime'])

In [119]:
bike['date_hour'] = bike['datetime'].dt.hour

In [120]:
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,date_hour
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,0
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,2
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13,3
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1,4

In [136]:
res = bike.groupby('date_hour')['registered'].mean().reset_index()

In [137]:
res

    date_hour  registered
0           0   44.826374
1           1   27.345815
2           2   18.080357
3           3    9.076212
4           4    5.144796
5           5   18.311947
6           6   72.109890
7           7  202.202198
8           8  341.226374
9           9  190.824176
10         10  128.973626
11         11  150.621978
12         12  187.677632
13         13  183.728070
14         14  166.853070
15         15  178.269737
16         16  241.289474
17         17  393.324561
18         18  369.462719
19         19  266.203947
20         20  191.785088
21         21  144.802632
22         22  110.973684
23         23   74.046053

In [138]:
res.loc[res['registered'] == res['registered'].max()]

    date_hour  registered
17         17  393.324561

In [144]:
res.iloc[res['registered'].idxmax()]

date_hour      17.000000
registered    393.324561
Name: 17, dtype: float64